app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" DESC LIMIT $2  [["email", "arjun@truweight.in"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "age", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Arjun"], ["email", "arjun@truweight.in"], ["age", 30], ["gender", "Male"], ["created_at", "2023-12-15 08:00:18.908236"], ["updated_at", "2023-12-15 08:00:18.908236"]]
---
	def user_create
		user_entry = User.where(email: params["email"]).last
		if user_entry.present?
			message = "User with Same email is Already Found"
		else
			user = User.create(name: params["name"], email: params["email"], age: params["age"], gender: params["gender"])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "vish@truweight.in"], ["updated_at", "2023-12-15 08:07:22.945317"], ["id", 1]]
---
	def user_update
		user_entry = User.find_by_id(params["id"])
		if user_entry.present?
			user_entry.update(name: params["name"], email: params["email"], age: params["age"], gender: params["gender"])